Repository: bfavrel/d7_so_forms
Catalog: translation/so_forms_d7.*.po
Languages: fr

source: Group
fr: Groupe

source: configure
fr: configurer

source: delete
fr: supprimer

source: Original field : !field_name
fr: Champ original : !field_name

source: Form parameters for display '@display'
fr: Paramètres du formulaire pour l'affichage '@display'

source: Save configuration
fr: Enregistrer la configuration

source: Basic parameters
fr: Paramètres de base

source: Form's title
fr: Titre du formulaire

source: Submit button's label
fr: Label du bouton de soumission

source: In english (it will be automatically translated at display).<br />No label = no button.
fr: En anglais (il sera automatiquement traduit à l'affichage).<br />Pas de label = pas de bouton.

source: Reset button's label
fr: Label du bouton de réinitialisation

source: Advanced parameters
fr: Paramètres avancés

source: Store values in user's session ?
fr: Stocker les valeurs dans la session utilisateur ?

source: Store values in database and provide an URL key ?
fr: Stocker les valeurs en base de données et fournir une clé d'URL ?

source: Use the 'advanced' form region ?
fr: Utiliser la région 'avancé' ?

source: Redirection path
fr: Chemin de redirection

source: Valid Drupal path with possibly URL GET parameters.<br />If this parameter is set, the redirect callback set for this form won't be called !
fr: Chemin Drupal valid avec éventuellement des parmètres d'URL.<br />Si ce paramètre est renseigné, le callback de redirection ne sera pas appelé !

source: Classes to apply to the form
fr: Classes à appliquer au formulaire

source: Separated by commas.
fr: Séparées par une virgule.

source: Add an existing display
fr: Ajouter un affichage existant

source: Add a new display
fr: Ajouter un nouvel affichage

source: Delete current display
fr: Supprimer l'affichage courant

source: nothing
fr: rien

source: Displays
fr: Affichages

source: Operation
fr: Opération

source: Use existing
fr: Utiliser l'affichage

source: Copy form's configuration from
fr: Copier la configuration du formulaire à partir de l'affichage

source: Copy field's configuration from
fr: Copier la configuration des champs à partir de l'affichage

source: Label
fr: Étiquette

source: translatable
fr: traductible

source: All parameters associated with this display will be deleted with no confirmation !
fr: Tous les paramètres associés à cet affichage seront supprimés sans autre demande de confirmation !

source: Proceed
fr: Procéder

source: none
fr: aucun(e)

source: The resulting form can be displayed using
fr: Le formulaire résultant peut être affiché en utilisant

source: Save
fr: Enregistrer

source: -- Select a field --
fr: -- Sélectionner un champ --

source: If empty, field label will be used.
fr: Si vide, le label du champ sera utilisé.

source: Field
fr: Champ

source: Field type
fr: Type de champ

source: Select a field
fr: Sélectionner un champ

source: Add a field
fr: Ajouter un champ

source: Field values
fr: Valeurs du champ

source: No value available
fr: Aucune valeur disponible

source: Title
fr: Titre

source: Add a group
fr: Ajouter un groupe

source: Back
fr: Retour

source: You have to select a field.
fr: Vous devez sélectionner un champ.

source: You have to select a field type.
fr: Vous devez sélectionner un type de champ.

source: You have to set a title for this group.
fr: Vous devez entrer un titre pour ce groupe

source: Field's configuration has been saved
fr: La configuration du champ a été sauvegardée.

source: Form's configuration has been saved
fr: La configuration du formulaire a été sauvegardée

source: Display has been set.
fr: L'affichage a été mis en place.

source: Display has been deleted.
fr: L'affichage a été supprimé.

source: Field '@field' configuration
fr: Configuration du champ '@field'

source: Display the group label
fr: Afficher le titre du groupe

source: Group's' configuration has been saved.
fr: La configuration du groupe a été sauvegardée.

source: Advanced form
fr: Formulaire avancé

source: Normal form
fr: Formulaire normal

source: Enabled
fr: Activé

source: Weight
fr: Poids

source: Operations
fr: Actions

source: Add field
fr: Ajouter un champ

source: Add group
fr: Ajouter un groupe

source: Configure module
fr: Configurer le module

source: Edit module's settings.
fr: Editer les paramètres du module.

source: User interfaces building API
fr: API de développement d'interfaces-utilisateur

source: Forms! Enhanced numerical widgets
fr: Forms! Widgets numériques améliorés

source: Provide a slider widget to Forms! (and perhaps further a knob one)
fr: Fourni un widget de type glissière (et, peut-être, plus-tard, bouton rotatif)

source: Slider type
fr: Type de glissière

source: Exact number (ex : "<strong>X</strong> people")
fr: Valeur exacte (ex : "<strong>X</strong> personnes")

source: Maximum number (ex : "from 0 to <strong>X</strong>€")
fr: Valeur maximum (ex : "de 0 à <strong>X</strong>€")

source: Absolute maximum number (ex : "<strong>X</strong>€ and less")
fr: Valeur maximum absolue (ex : "<strong>X</strong>€ et moins")

source: Minimum number (ex : "from <strong>X</strong> to 200€")
fr: Valeur minimum (ex : "de <strong>X</strong> à 200€")

source: Absolute minimum number (ex : "<strong>X</strong>€ and more")
fr: Valeur minimum absolue (ex : "<strong>X</strong>€ et plus")

source: Numbers range (ex : "from <strong>X</strong> to <strong>Y</strong> days")
fr: Plage de valeurs (ex : "de <strong>X</strong> à <strong>Y</strong> jours")

source: Minimum value
fr: Valeur limite minimum

source: Minimum available value : '@val'
fr: Valeur minimum disponible : '@val'

source: Maximum value
fr: Valeur limite maximum

source: Maximum available value : '@val'
fr: Valeur maximum disponible : '@val'

source: Display the limits
fr: Afficher les valeurs limites

source: Interval between two values
fr: Intervalle entre deux valeurs

source: Can be decimal
fr: Peut être décimal

source: unit
fr: unité

source: Value label
fr: Étiquette de la valeur

source: Ex : "Number of people" will be displayed as this : "<strong>Number of people</strong> : 3 people"
fr: Ex : "Nombre de personnes" sera affiché : "<strong>Nombre de personnes</strong> : 3 personnes"

source: Value unit
fr: Unité de la valeur

source: Ex : " bedrooms" will be displayed as this : "Minimum number of bedrooms : 3 <strong>bedrooms</strong>"
fr: Ex : " chambres" sera affiché : "Nombre minimum de chambres : 3 <strong>chambres</strong>"

source: You can use a space to separate the unit from the number.
fr: Vous pouvez utiliser un espace pour séparer l'unité du nombre.

source: from @slider_min to #1
fr: de @slider_min à #1

source: #1@unit and less
fr: #1@unit et moins

source: from #1 to @slider_max
fr: de #1 à @slider_max

source: #1@unit and more
fr: #1@unit et plus

source: from #1 to #2
fr: de #1 à #2

source: Use field label
fr: Afficher l'étiquette du champ

source: Field prefix
fr: Préfixe du champ

source: Field suffix
fr: Suffixe du champ

source: Options creation method
fr: Méthode de création des options

source: Additive method : select predefined options to use among existing values
fr: Méthode additive : sélectionner des options prédéfinies parmi les valeurs existantes

source: Substractive method : unselect options to not use among existing values
fr: Méthode soustractive : désélectionner des options à ne pas utiliser parmi les valeurs existantes

source: Build predefined options from existing values (unique usage of values)
fr: Construire des options prédéfinies à partir des valeurs existantes (usage unique de chaque valeur)

source: Build predefined options from existing values (multiple usage of values)
fr: Construire des options prédéfinies à partir des valeurs existantes (usage multiple des valeurs)

source: Values will be updated after save
fr: Les valeurs seront mises à jour après sauvegarde

source: Display the check boxes group label
fr: Afficher l'étiquette du groupe de cases à cocher

source: Check boxes options
fr: Options des cases à cocher

source: Select values to use as predefined options
fr: Sélectionner les valeurs à utiliser comme options prédéfinies

source: Deselect values to discard
fr: Désélectionner les valeurs à écarter

source: currently unavailable value
fr: valeur actuellement indisponible

source: Delete
fr: Supprimer

source: If empty, checked value will be used.
fr: Si non rempli, la valeur sélectionnée sera utilisée

source: Exposed value
fr: Valeur exposée

source: Available values
fr: Valeurs disponibles

source: Add
fr: Ajouter

source: You have to select at least one value
fr: Vous devez sélectionner au moins une valeur

source: Field has no option anymore.
fr: Le champ n'a plus d'options à proposer

source: Exposed
fr: Exposé

source: Value
fr: Valeur

source: Add an option
fr: Ajouter une option

source: Values
fr: Valeurs

source: Help text
fr: Texte d'aide

source: Field 'start' label
fr: Etiquette du champ 'debut'

source: From
fr: De

source: Field 'end' label
fr: Etiquette du champ 'fin'

source: To
fr: À

source: Values to use when the box is checked
fr: Valeurs correspondantes à la case à cocher

source: Display the label of the radios buttons group
fr: Afficher l'étiquette du groupe de boutons radios

source: Add a 'select all' option
fr: Ajouter une option de type 'tout sélectionner'

source: None
fr: Aucun(e)

source: Indifferent
fr: Indifférent

source: All (male)
fr: Tous

source: All (female)
fr: Toutes

source: Distplay the label of the select box
fr: Afficher l'étiquette de la liste déroulante

source: Select box options
fr: Options de la liste déroulante

source: Label's style
fr: Style du titre du champ

source: Outside field
fr: En dehors du champ

source: Inside field
fr: Dans le champ

source: No label
fr: Pas de titre
